# ExternalParameterService Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..ExternalParameterService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
Autodesk Internal: The service for shared parameter selection.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId ExternalParameterService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExternalParameterService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ ExternalParameterService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace